# # コンソールに出力
# print("Hello World")
# -------------------------------------------
# # 変数宣言
# x = "Hello World"
# print(x)
# -------------------------------------------
# # 変数の再代入
# x = "Hello World"
# -------------------------------------------
# x = "変数の再代入"
# print(x)
# -------------------------------------------
# # 演算
# a = 1 + 1
# print(a)
# b = 2 - 1
# print(b)
# c = 3 * 3
# print(c)
# d = 12 / 4
# print(d)
# e = 12 % 5
# print(e)
# -------------------------------------------
# インクリメント演算子
# ※pythonにはインクリメントがないらしい
# f = 1
# f += f
# print(f)
# -------------------------------------------
# typeについて
# 数値型
# a = 1
# print(type(a))
# -------------------------------------------
# 浮動小数点
# b = 0.3
# print(type(b))
# -------------------------------------------
# 文字列
# c = "こんにちは"
# print(type(c))
# -------------------------------------------
# 真偽値
# d = True
# print(type(d))
# e = False
# print(type(e))
# -------------------------------------------
# 未定義、Null
# pythonでは、javascriptでいうundefinedがありません。
# また、NullではなくNoneがあります。
# f = None
# print(type(f))
# -------------------------------------------
# リスト型（配列）
# ミュータブル (英: mutable) なオブジェクトとは、
# 作成後も状態を変えることができる。
# mylist = ["りんご", "ばなな", "みかん"]
# print(type(mylist))
# -------------------------------------------
# ディクショナリ型（辞書型）
# mydict = {
#     "first_name": "sato",
#     "last_name": "mikihito",
#     "age": "23",
#     "city": "miyazaki",
# }
# print(type(mydict))
# -------------------------------------------
# tuple型
# イミュータブル (英: immutable) なオブジェクトとは、
# 作成後にその状態を変えることのできないオブジェクトのことである
# mytuple = ("こんにちは", "こんばんは", "おはよう")
# print(type(mytuple))
# -------------------------------------------
# 関数（function）
# 定義 (Definition)
# def myfunc():
#     return 1


# print(type(myfunc))
# -------------------------------------------
# if文
# x = 200

# if x == 100:
#     print("x = 100")
# elif x == 200:
#     print("x = 200")
# elif x > 0:
#     print("x = 300")
# elif x == 0:
#     print("x = 400")
# else:
#     print("条件を満たしていません")
# -------------------------------------------
# for文
# for文の構成
# for 変数 in オブジェクト:
#     実行する処理
# words = ["Japanese", "English", "French"]
# for word in words:
#     print(word)
# -------------------------------------------
# モジュールとは
# モジュールの読み込み方
# import モジュール名
# import datetime
# または、from モジュール名 import クラス名or関数名
# from datetime import datetime

# ddd = datetime.today().day

# print(ddd)
